% подбор видеокарты

rule(1, "видеокарта", "игровая", [1]).
rule(2, "видеокарта", "офисная", [2]).
rule(3, "видеокарта", "для майнинга", [3]).
rule(4, "игровая", "бюджетная", [4]).
rule(5, "игровая", "дорогая", [5]).
rule(6, "офисная", "активная", [6]).
rule(7, "офисная", "пассивная", [7]).
rule(8, "для майнинга", "экономичная", [8]).
rule(9, "для майнинга", "производительная", [9]).
rule(10, "бюджетная", "бу", [10]).
rule(11, "бюджетная", "новая", [11]).
rule(12, "дорогая", "MSI RTX 3080 Suprim", [12, 15]).
rule(13, "активная", "Gigabyte GTX 1030", [13, 15]).
rule(14, "пассивная", "Asus GTX 1030", [14, 15]).
rule(15, "экономичная", "экономичная новая", [11]).
rule(16, "производительная", "производительная новая", [11]).
rule(17, "с рейтрейсингом", "любая RTX 3050", [16]).
rule(18, "без рейтрейсинга", "Radeon RX 6600 xt", [17]).
rule(19, "бу", "с рейтрейсингом", [18]).
rule(20, "бу", "без рейтрейсинга", [19]).
rule(21, "новая", "без рейтрейсинга", [19]).
rule(22, "новая", "с рейтрейсингом", [18]).
rule(23, "экономичная бу", "Radeon RX 6900 xt", [12]).
rule(24, "экономичная новая", "Radeon RX 6800 xt", [12]).
rule(25, "производительная бу", "Asus rog RTX 3090", [15]).
rule(26, "производительная новая", "Asus rog RTX 3080", [15]).
rule(27, "экономичная", "экономичная бу", [10]).
rule(28, "производительная", "производительная бу", [10]).

ask(1):- write("нужна игровая видеокарта?"),!,complete(1).
ask(2):- write("нужна офисная видеокарта?"),!,complete(2).
ask(3):- write("нужна видеокарта для майнинга?"),!,complete(3).
ask(4):- write("бюджет ограничен?"),!,complete(4).
ask(5):- write("производительность важнее всего?"),!,complete(5).
ask(6):- write("должна быть холодной?"),!,complete(6).
ask(7):- write("должна быть тихой?"),!,complete(7).
ask(8):- write("дорогая электроэнергия?"),!,complete(8).
ask(9):- write("должна много майнить?"),!,complete(9).
ask(10):- write("рассматриваете покупку с рук?"),!,complete(10).
ask(11):- write("нужна новая карта?"),!,complete(11).
ask(12):- write("нужен популярный бренд?"),!,complete(12).
ask(13):- write("достаточно 1 вентилятора?"),!,complete(13).
ask(14):- write("подойдет низкопрофильное исполнение?"),!,complete(14).
ask(15):- write("нужно лучшее исполнение?"),!,complete(15).
ask(16):- write("вендор не важен?"),!,complete(16).
ask(17):- write("производитель чипа не важен?"),!,complete(17).
ask(18):- write("будете включать лучи?"),!,complete(10).
ask(19):- write("важна чистая производительность?"),!,complete(11).

ask(X):- fact(X, "да"),!.
ask(X):- fact(X, "нет"),!,fail.

recognition(X):- rule(N, X, Y, Z), discover(Z), !,
write("!!!!"), write(X), write(" - "), write(Y), write(" по правилу "), write(N), nl,
recognition(Y).
recognition("видеокарта"):- write("не удалось подобрать вам видеокарту"),!.
recognition("офисная"):- write("вам подойдет офисная видеокарта"),!.
recognition(_).
discover([]).
discover([X|Y]):- ask(X), discover(Y).
complete(X):- nl, read(Y), assert(fact(X, Y)), Y="да".
